HA_1C/Catalogs/ДеталиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДеталиПроекта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HA_1C/Catalogs/ДеталиПроекта/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ЗапроситьПараметрыДетали(МассивСсылок) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДеталиПроектаХарактеристики.Характеристика КАК Характеристика,
	|	ДеталиПроектаХарактеристики.Характеристика.ЕдиницаИзмерения.ТипХарактеристики КАК ТипХарактеристики,
	|	0 КАК Значение
	|ИЗ
	|	Справочник.ДеталиПроекта.Характеристики КАК ДеталиПроектаХарактеристики
	|ГДЕ
	|	ДеталиПроектаХарактеристики.Ссылка В (&Ссылка)");
	Запрос.УстановитьПараметр("Ссылка", МассивСсылок);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
